# Задайте список из нескольких чисел. Напишите программу, 
# которая найдёт сумму элементов списка, стоящих на нечётной позиции.

# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


num_lst = list(map(int, input('Enter the numbers, separated by a "Space": ').split()))
print(num_lst, '->', sum(num_lst[1::2]))
